<a href="https://colab.research.google.com/github/fennellclyde/python_projects/blob/main/Copy_of_04_lambdas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
nums = range(10)
cities = ['Bengaluru', 'London', 'York', 'Manchester', 'Newcastle', 'Delhi', 'Mumbai', 'Cairo', 'Cape Town', 'Nairobi']
data = {
    'column1': nums,
    'cities': cities
}

In [2]:
import pandas as pd
df = pd.DataFrame(data)

In [3]:
# SYNTAX
# lambda input_variable : what_to_do_with_the_input_variable
mylambda = lambda myvar : myvar*2

In [4]:
mylambda(42)

84

In [5]:
# Superpower-> reusability 
def randompower(pow):
  return lambda n: n**pow
# ACCEPTING 2 variables, and returning a lambda consisting of 2 
# variables-> one initialized by function, and other by the user!

In [10]:
square = randompower(2) # this changes-> lambda n,2: n**2
cube = randompower(3) # this changes-> lambda n,3 : n**3

In [11]:
square(9)

81

In [12]:
cube(8)

512

In [13]:
# Transformation
counter = 0
city_dictionary = {}
for city in cities:
  city_dictionary[city] = counter # London = 1
  counter = counter+1 # for next city, incrementing the counter

In [14]:
city_dictionary

{'Bengaluru': 0,
 'Cairo': 7,
 'Cape Town': 8,
 'Delhi': 5,
 'London': 1,
 'Manchester': 3,
 'Mumbai': 6,
 'Nairobi': 9,
 'Newcastle': 4,
 'York': 2}

In [15]:
# WE COULD WRITE A LAMBDA FUNCTION TO TRANSFORM CITY 
# NAMES INTO NUMBERS!
df.head()

   column1      cities
0        0   Bengaluru
1        1      London
2        2        York
3        3  Manchester
4        4   Newcastle

In [16]:
citynum = lambda city_name: city_dictionary[city_name]
df['cities_encoded'] = df['cities'].map(citynum)

In [17]:
df.head(10)

   column1      cities  cities_encoded
0        0   Bengaluru               0
1        1      London               1
2        2        York               2
3        3  Manchester               3
4        4   Newcastle               4
5        5       Delhi               5
6        6      Mumbai               6
7        7       Cairo               7
8        8   Cape Town               8
9        9     Nairobi               9